### SPLIT COMBINE APPLY

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'key1' : 'a a b b a'.split(),
                   'key2' : 'one two one two one'.split(),
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})

In [3]:
df

  key1 key2     data1     data2
0    a  one  0.474786 -1.620907
1    a  two  1.177674  1.493416
2    b  one -0.792066  1.028442
3    b  two  2.577556 -0.489333
4    a  one  1.188566 -1.130423

In [4]:
grouped = df['data1'].groupby(df['key1'])

In [5]:
grouped #this isn't actually computed yet? it's just an object?

In [6]:
grouped.mean()

key1
a    0.947009
b    0.892745
Name: data1, dtype: float64

In [7]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [8]:
means

key1  key2
a     one     0.831676
      two     1.177674
b     one    -0.792066
      two     2.577556
Name: data1, dtype: float64

In [9]:
means.unstack() #takes the innermost index and flattens it out to one row

key2       one       two
key1
a     0.831676  1.177674
b    -0.792066  2.577556

In [10]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
df['data1'].groupby([states, years]).mean()

California  2005    1.177674
            2006   -0.792066
Ohio        2005    1.526171
            2006    1.188566
Name: data1, dtype: float64

In [11]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.947009 -0.419305
b     0.892745  0.269554

In [12]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one   0.831676 -1.375665
     two   1.177674  1.493416
b    one  -0.792066  1.028442
     two   2.577556 -0.489333

In [13]:
df.groupby(['key1', 'key2']).size() #when groupby is passed multiple column names, it groups by one then the next?

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [14]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  0.474786 -1.620907
1    a  two  1.177674  1.493416
4    a  one  1.188566 -1.130423
b
  key1 key2     data1     data2
2    b  one -0.792066  1.028442
3    b  two  2.577556 -0.489333

In [15]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one  0.474786 -1.620907
4    a  one  1.188566 -1.130423
('a', 'two')
  key1 key2     data1     data2
1    a  two  1.177674  1.493416
('b', 'one')
  key1 key2     data1     data2
2    b  one -0.792066  1.028442
('b', 'two')
  key1 key2     data1     data2
3    b  two  2.577556 -0.489333

In [16]:
pieces = dict(list(df.groupby('key1')))

In [17]:
pieces

{'a':   key1 key2     data1     data2
 0    a  one  0.474786 -1.620907
 1    a  two  1.177674  1.493416
 4    a  one  1.188566 -1.130423, 'b':   key1 key2     data1     data2
 2    b  one -0.792066  1.028442
 3    b  two  2.577556 -0.489333}

In [18]:
pieces['b']

  key1 key2     data1     data2
2    b  one -0.792066  1.028442
3    b  two  2.577556 -0.489333

In [19]:
df.groupby('key1')['data1']
df.groupby('key1')[['data2']]

In [20]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns='a b c d e'.split(),
                      index='Joe Steve Wes Jim Travis'.split())

In [21]:
people.iloc[2:3, [1, 2]] = np.nan

In [22]:
people

               a         b         c         d         e
Joe    -0.652704 -1.480547  0.614271  0.927303 -1.532810
Steve   1.734421  0.390962 -1.083733 -0.075712 -0.212349
Wes    -0.544231       NaN       NaN -0.609279 -1.243225
Jim     1.013216  1.291765 -1.229081 -0.312346  1.544690
Travis  0.042845  0.035841  0.730821  0.578846  1.226359

In [23]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
           'd': 'blue', 'e': 'red', 'f': 'orange'}

In [24]:
by_column = people.groupby(mapping, axis=1) #the mapping partitions the df into a number of bins.

In [25]:
by_column.sum()

            blue       red
Joe     1.541574 -3.666062
Steve  -1.159445  1.913034
Wes    -0.609279 -1.787455
Jim    -1.541427  3.849670
Travis  1.309667  1.305045

In [26]:
map_series = pd.Series(mapping)

In [27]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [28]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [29]:
people.groupby(len).sum()

          a         b         c         d         e
3 -0.183719 -0.188782 -0.614810  0.005678 -1.231345
5  1.734421  0.390962 -1.083733 -0.075712 -0.212349
6  0.042845  0.035841  0.730821  0.578846  1.226359

In [30]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [31]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -0.652704 -1.480547  0.614271 -0.609279 -1.532810
  two  1.013216  1.291765 -1.229081 -0.312346  1.544690
5 one  1.734421  0.390962 -1.083733 -0.075712 -0.212349
6 two  0.042845  0.035841  0.730821  0.578846  1.226359

In [32]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                     [1, 3, 5, 1, 3]],
                                    names=['cty', 'tenor'])

In [33]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [34]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.021709 -2.122655  0.670681  2.877968  1.771487
1      0.116024  1.015630  1.153827  1.650894 -0.134533
2      0.381923  0.414054  0.327039  0.304843  0.236968
3     -1.496130  1.703789  0.195696 -1.130201 -0.441913

In [35]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [36]:
hier_df.groupby(level='cty', axis=1).count().groupby(lambda x: x < 2).count()

cty    JP  US
False   2   2
True    2   2

In [37]:
df

  key1 key2     data1     data2
0    a  one  0.474786 -1.620907
1    a  two  1.177674  1.493416
2    b  one -0.792066  1.028442
3    b  two  2.577556 -0.489333
4    a  one  1.188566 -1.130423

In [38]:
grouped = df.groupby('key1')

In [39]:
grouped['data1'].quantile(.9)

key1
a    1.186388
b    2.240594
Name: data1, dtype: float64

In [40]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [41]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     0.713781  3.114322
b     3.369622  1.517775

In [42]:
grouped.describe()

     data1                                                             \
     count      mean       std       min       25%       50%      75%
key1
a      3.0  0.947009  0.408994  0.474786  0.826230  1.177674  1.18312
b      2.0  0.892745  2.382683 -0.792066  0.050339  0.892745  1.73515

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     1.188566   3.0 -0.419305  1.674520 -1.620907 -1.375665 -1.130423
b     2.577556   2.0  0.269554  1.073229 -0.489333 -0.109889  0.269554


           75%       max
key1
a     0.181496  1.493416
b     0.648998  1.028442

###  Column-Wise and Multiple Function Application:

In [43]:
tips = pd.read_csv('../pydata-book/examples/tips.csv')

In [44]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [45]:
tips[:6]

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [46]:
grouped = tips.groupby(['day', 'smoker'])

In [47]:
grouped_pct = grouped['tip_pct']

In [48]:
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [49]:
grouped_pct.agg(['mean', 'std', peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [50]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)]) #lambdas will get a stupid name

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [51]:
functions = ['count', 'mean', 'max']
result = grouped['tip_pct', 'total_bill'].agg(functions)
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [52]:
result['tip_pct']

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [53]:
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [54]:
result['tip_pct'].groupby('smoker').mean() #looks like smokers tip slightly better?

        count      mean       max
smoker
No      37.75  0.157527  0.249677
Yes     23.25  0.168451  0.385203

In [55]:
ftuples = [('Durchschnitt', 'mean'), ('Abweichung', np.var)]

In [56]:
grouped['tip_pct', 'total_bill'].agg(ftuples)

                 tip_pct              total_bill
            Durchschnitt Abweichung Durchschnitt  Abweichung
day  smoker
Fri  No         0.151650   0.000791    18.420000   25.596333
     Yes        0.174783   0.002631    16.813333   82.562438
Sat  No         0.158048   0.001581    19.661778   79.908965
     Yes        0.147906   0.003767    21.276667  101.387535
Sun  No         0.160113   0.001793    20.506667   66.099980
     Yes        0.187250   0.023757    24.120000  109.046044
Thur No         0.160298   0.001503    17.113111   59.625081
     Yes        0.163863   0.001551    19.190588   69.808518

In [57]:
grouped.agg({'tip' : np.max, 'size' : 'sum'})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [58]:
grouped.agg({'tip_pct' : ['min', 'max', 'mean', 'std'],
             'size' : 'sum'})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

In [59]:
tips.groupby(['day', 'smoker'], as_index=False).mean()

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

In [60]:
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]

In [61]:
top(tips, n=6)

     total_bill   tip smoker  day    time  size   tip_pct
109       14.31  4.00    Yes  Sat  Dinner     2  0.279525
183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39     No  Sat  Dinner     2  0.291990
67         3.07  1.00    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Yes  Sun  Dinner     2  0.710345

In [62]:
tips.groupby('smoker').apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85     No  Thur   Lunch     2  0.236746
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       232       11.61  3.39     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [63]:
tips.groupby(['smoker', 'day']).apply(top, n=1, column='total_bill')

                 total_bill    tip smoker   day    time  size   tip_pct
smoker day
No     Fri  94        22.75   3.25     No   Fri  Dinner     2  0.142857
       Sat  212       48.33   9.00     No   Sat  Dinner     4  0.186220
       Sun  156       48.17   5.00     No   Sun  Dinner     6  0.103799
       Thur 142       41.19   5.00     No  Thur   Lunch     5  0.121389
Yes    Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.117750
       Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.196812
       Sun  182       45.35   3.50    Yes   Sun  Dinner     3  0.077178
       Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.115982

In [64]:
result = tips.groupby('smoker')['tip_pct'].describe()

In [65]:
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [66]:
result.unstack()

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

In [67]:
frame = pd.DataFrame({'data1': np.random.randn(1000),
                      'data2': np.random.randn(1000)})

In [68]:
quartiles = pd.cut(frame.data1, 4)

In [69]:
quartiles[:10]

0    (-1.54, -0.108]
1    (-0.108, 1.324]
2    (-0.108, 1.324]
3    (-0.108, 1.324]
4    (-0.108, 1.324]
5     (1.324, 2.756]
6    (-1.54, -0.108]
7    (-1.54, -0.108]
8    (-1.54, -0.108]
9    (-0.108, 1.324]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-2.977, -1.54] < (-1.54, -0.108] < (-0.108, 1.324] < (1.324, 2.756]]

In [70]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(),
            'count': group.count(), 'mean': group.mean()}

In [71]:
grouped = frame.data2.groupby(quartiles)

In [72]:
grouped.apply(get_stats).unstack()

                 count       max      mean       min
data1
(-2.977, -1.54]   65.0  2.942206  0.080264 -2.410624
(-1.54, -0.108]  378.0  2.583418  0.131004 -3.140821
(-0.108, 1.324]  456.0  2.863225  0.011821 -2.631757
(1.324, 2.756]   101.0  2.602223 -0.104625 -2.209157

In [73]:
grouping = pd.qcut(frame.data1, 10, labels=False)
grouped = frame.data2.groupby(grouping)
grouped.apply(get_stats).unstack()

       count       max      mean       min
data1
0      100.0  2.942206  0.110818 -3.140821
1      100.0  2.477274  0.083364 -2.174182
2      100.0  2.171717  0.005173 -2.284481
3      100.0  2.583418  0.243189 -2.031325
4      100.0  2.426939  0.165885 -2.231875
5      100.0  2.662504 -0.019892 -2.203643
6      100.0  2.863225  0.088814 -2.388974
7      100.0  2.606442 -0.036638 -2.236751
8      100.0  2.433802 -0.032106 -2.631757
9      100.0  2.602223 -0.113011 -2.209157

In [74]:
s = pd.Series(np.random.randn(6))

In [75]:
s[::2] = np.nan

In [76]:
s

0         NaN
1    1.025073
2         NaN
3   -1.906095
4         NaN
5   -0.034659
dtype: float64

In [77]:
s.fillna(s.mean())

0   -0.305227
1    1.025073
2   -0.305227
3   -1.906095
4   -0.305227
5   -0.034659
dtype: float64

In [78]:
states = ['Ohio', 'New York', 'Vermont', 'Florida',
          'Oregon', 'Nevada', 'California', 'Idaho']

In [79]:
group_key = ['East'] * 4 + ['West'] * 4

In [80]:
data = pd.Series(np.random.randn(8), index=states)

In [81]:
data

Ohio         -1.730100
New York      0.505784
Vermont       1.316278
Florida      -0.628319
Oregon       -1.979180
Nevada       -1.172545
California   -1.476564
Idaho        -0.846624
dtype: float64

In [82]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan

In [83]:
data

Ohio         -1.730100
New York      0.505784
Vermont            NaN
Florida      -0.628319
Oregon       -1.979180
Nevada             NaN
California   -1.476564
Idaho              NaN
dtype: float64

In [84]:
data.groupby(group_key).mean()

East   -0.617545
West   -1.727872
dtype: float64

In [85]:
fill_mean = lambda g: g.fillna(g.mean())

In [86]:
data.groupby(group_key).apply(fill_mean)

Ohio         -1.730100
New York      0.505784
Vermont      -0.617545
Florida      -0.628319
Oregon       -1.979180
Nevada       -1.727872
California   -1.476564
Idaho        -1.727872
dtype: float64

### Random Sampling and Permuation

In [87]:
suits = ['H', 'S', 'C', 'D']

In [88]:
card_val = (list(range(1, 11)) + [10] * 3) * 4

In [89]:
base_names = ['A'] + list(range(2, 11)) + ['J', 'Q', 'K']

In [90]:
cards = []

In [91]:
for suit in suits:
    cards.extend(str(num) + suit for num in base_names)

In [92]:
deck = pd.Series(card_val, index=cards)

In [93]:
def draw(deck, n=5):
    return deck.sample(n)

In [94]:
draw(deck)

QH    10
2D     2
QD    10
9H     9
5S     5
dtype: int64

In [95]:
get_suit = lambda card: card[-1]

In [96]:
deck.groupby(get_suit).apply(draw, n=2)

C  QC     10
   6C      6
D  QD     10
   3D      3
H  JH     10
   QH     10
S  2S      2
   10S    10
dtype: int64

In [97]:
df = pd.DataFrame({'category': ['a', 'a', 'a', 'a',
                                'b', 'b', 'b', 'b',],
                   'data': np.random.randn(8),
                   'weights': np.random.randn(8)})

In [98]:
df

  category      data   weights
0        a  0.181219  0.420379
1        a  1.744719  0.076175
2        a  0.018770  0.125627
3        a  0.848439  1.158729
4        b  0.511326 -0.138402
5        b  0.653110  0.615901
6        b  0.337688  1.394623
7        b -0.821440  0.173226

In [99]:
grouped = df.groupby('category')

In [100]:
get_wavg = lambda g: np.average(g['data'], weights=g['weights'])

In [101]:
grouped.apply(get_wavg)

category
a    0.670754
b    0.322749
dtype: float64

In [102]:
close_px = pd.read_csv('../pydata-book/examples/stock_px_2.csv', parse_dates=True,
                       index_col=0)

In [103]:
close_px.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 2214 entries, 2003-01-02 to 2011-10-14
Data columns (total 4 columns):
AAPL    2214 non-null float64
MSFT    2214 non-null float64
XOM     2214 non-null float64
SPX     2214 non-null float64
dtypes: float64(4)
memory usage: 86.5 KB

In [104]:
close_px[-4:]

              AAPL   MSFT    XOM      SPX
2011-10-11  400.29  27.00  76.27  1195.54
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

In [105]:
spx_corr = lambda x: x.corrwith(x['SPX'])

In [106]:
rets = close_px.pct_change().dropna()

In [107]:
get_year = lambda x: x.year

In [108]:
by_year = rets.groupby(get_year)

In [109]:
by_year.apply(spx_corr)

          AAPL      MSFT       XOM  SPX
2003  0.541124  0.745174  0.661265  1.0
2004  0.374283  0.588531  0.557742  1.0
2005  0.467540  0.562374  0.631010  1.0
2006  0.428267  0.406126  0.518514  1.0
2007  0.508118  0.658770  0.786264  1.0
2008  0.681434  0.804626  0.828303  1.0
2009  0.707103  0.654902  0.797921  1.0
2010  0.710105  0.730118  0.839057  1.0
2011  0.691931  0.800996  0.859975  1.0

In [110]:
by_year.apply(lambda g: g['AAPL'].corr(g['MSFT']))

2003    0.480868
2004    0.259024
2005    0.300093
2006    0.161735
2007    0.417738
2008    0.611901
2009    0.432738
2010    0.571946
2011    0.581987
dtype: float64

### Group weighted average and correlation

In [111]:
import pandas as pd
import numpy as np

In [112]:
df = pd.DataFrame({'category': ['a', 'a', 'a', 'a',
                                'b', 'b', 'b', 'b'],
                   'data': np.random.randn(8),
                   'weights': np.random.rand(8)})

In [113]:
df

  category      data   weights
0        a  1.370693  0.480234
1        a -0.795553  0.052752
2        a -1.753898  0.655451
3        a -0.201544  0.572330
4        b  1.026059  0.101216
5        b -0.161731  0.061495
6        b -0.617380  0.781889
7        b -0.037744  0.930048

In [114]:
grouped = df.groupby('category')

In [115]:
grouped

In [116]:
get_wavg = lambda g: np.average(g['data'], weights=g['weights'])

In [117]:
grouped.apply(get_wavg)

category
a   -0.368395
b   -0.226132
dtype: float64

### end of day prices

In [118]:
close_px = pd.read_csv('../pydata-book/examples/stock_px_2.csv', parse_dates=True,
                       index_col=0)

In [119]:
close_px.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 2214 entries, 2003-01-02 to 2011-10-14
Data columns (total 4 columns):
AAPL    2214 non-null float64
MSFT    2214 non-null float64
XOM     2214 non-null float64
SPX     2214 non-null float64
dtypes: float64(4)
memory usage: 86.5 KB

In [120]:
close_px[-4:]

              AAPL   MSFT    XOM      SPX
2011-10-11  400.29  27.00  76.27  1195.54
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

In [121]:
spx_corr = lambda x: x.corrwith(x['SPX'])

In [122]:
rets = close_px.pct_change().dropna()

In [123]:
get_year = lambda x: x.year

In [124]:
by_year = rets.groupby(get_year)

In [125]:
by_year.apply(spx_corr)

          AAPL      MSFT       XOM  SPX
2003  0.541124  0.745174  0.661265  1.0
2004  0.374283  0.588531  0.557742  1.0
2005  0.467540  0.562374  0.631010  1.0
2006  0.428267  0.406126  0.518514  1.0
2007  0.508118  0.658770  0.786264  1.0
2008  0.681434  0.804626  0.828303  1.0
2009  0.707103  0.654902  0.797921  1.0
2010  0.710105  0.730118  0.839057  1.0
2011  0.691931  0.800996  0.859975  1.0

In [126]:
by_year.apply(lambda g: g['AAPL'].corr(g['MSFT']))

2003    0.480868
2004    0.259024
2005    0.300093
2006    0.161735
2007    0.417738
2008    0.611901
2009    0.432738
2010    0.571946
2011    0.581987
dtype: float64

###  statsmodels?

In [127]:
import statsmodels.api as sm

In [128]:
def regress(data, yvar, xvars):
    Y = data[yvar]
    X = data[xvars]
    X['intercept'] = 1.
    result = sm.OLS(Y, X).fit()
    return result.params

In [129]:
by_year.apply(regress, 'AAPL', ['SPX'])

           SPX  intercept
2003  1.195406   0.000710
2004  1.363463   0.004201
2005  1.766415   0.003246
2006  1.645496   0.000080
2007  1.198761   0.003438
2008  0.968016  -0.001110
2009  0.879103   0.002954
2010  1.052608   0.001261
2011  0.806605   0.001514

Pivot tables aggregate and rearrange the data in a dataframe.
By default, the aggregation function is the mean but we can change that.